app/controllers/admin/apologizes_controller.rb

SELECT "apologizes".* FROM "apologizes"
---
  def index
    @apologizes = Apologize.all

INSERT INTO "apologizes" ("apologize_image", "description", "person_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["apologize_image", "haha"], ["description", "haha1"], ["person_id", -1], ["created_at", "2016-07-24 12:42:43.783052"], ["updated_at", "2016-07-24 12:42:43.783052"]]
---
  def create
    @apologize = Apologize.new(apologize_params)

      if @apologize.save

UPDATE "apologizes" SET "description" = ?, "person_id" = ?, "updated_at" = ? WHERE "apologizes"."id" = ?  [["description", "11"], ["person_id", 4], ["updated_at", "2016-07-24 12:48:38.092193"], ["id", 3]]
---
  def update

      if @apologize.update(apologize_params)

DELETE FROM "apologizes" WHERE "apologizes"."id" = ?  [["id", 1]]
---
  def destroy
    @apologize.destroy

SELECT  "apologizes".* FROM "apologizes" WHERE "apologizes"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_apologize
      @apologize = Apologize.find(params[:id])